select [Название города], AVG(Люди.Возраст) as [средний возраст людей]
from Люди join [Город людей] on Люди.[id города людей]=[Город людей].[id города людей]
group by [Город людей].[Название города]

select count(Конференция.Аудитория) as [кол-во аудиторий на 1 конференцию],Конференция.Дата as [дата конференции]
from Конференция join секция on Конференция.[id конференции]=Секция.[id конференции] 
group by Конференция.Дата

select [Город конференции].[Номер дома],count([Город конференции].[Номер дома]) as [кол-во домов], round(rand(10)*100, 0) as [кол-во квартир]
from [Город конференции] 
group by [Номер дома]
order by [Город конференции].[Номер дома] asc

select Конференция.Дата, DATENAME(weekday,Конференция.Дата ) as [день недели]
from Конференция
where Дата = (select Дата from Секция where Дата = '0010-01-10')
order by Конференция.Дата asc

select Секция.Дата, DATEDIFF(year,Секция.Дата,GETDATE()) as [прошло лет]
from Секция

select SYSDATETIME()

select SPACE (Конференция.Аудитория)  as [хз зачем это]
from Конференция

select Люди.Фамилия,left ( Люди.Фамилия ,  3) as 'отрубает 3 символа'
from Люди

select Люди.Фамилия,RIGHT ( Люди.Фамилия ,  26) as [отрубает 6 символов]
from Люди

select Люди.Имя,LEN(Люди.Имя) as [кол-во букв имени]
from Люди

select HOST_NAME ()

select HOST_ID ()  

select NEWID ( )  

select Конференция.Аудитория,COUNT(Конференция.Дата) as [используется(кол-во дней)]
from Конференция
group by Конференция.Аудитория 





insert Секция([id секции],Дата,[id места],[id конференции])
values ('18','1312-05-12','15','15')
select*
from Секция

Select*
from Секция
update Секция
Set [id секции]='21' , Дата='1212-12-12', [id места]='15'
Where Секция.[id секции]='18'  

delete from Секция
Where Секция.[id секции] =21

insert [Научная степень]([Название научной стеени])
values ('огонь какая')
select*
from [Научная степень]

Update [Научная степень]
Set [Название научной стеени]='Магистр меча и магии'
Where [Название научной стеени]= 'огонь какая'
select* 
from [Научная степень]

delete from [Научная степень]
Where [Научная степень].[Название научной стеени]= 'Магистр меча и магии'
select* 
from [Научная степень]

insert [Место]([id места],[Название места])
values ('23','Петрозаводск')
select*
from [Место]

update  Место
Set [Название места]='25 км от мкада'
Where [Название места]= 'Петрозаводск'
select* 
from [место]

delete from Место
Where Место.[id места]='23'
select* 
from [место]

insert [Страна конференции]([id страны],[Название страны])
values ('22','Дагестан')
select*
from [Страна конференции]

update  [Страна конференции]
Set [Название страны]='Диктаторленд'
Where [Название страны]= 'Дагестан'
select* 
from [Страна конференции]

delete from [Страна конференции]
Where [Страна конференции].[Название страны]='Диктаторленд'
select* 
from [Страна конференции]
